const NextIcon = () => {
  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="21px"
      height="21px"
      viewBox="0 0 21 21"
      version="1.1"
    >
      <title>1. 图标/2. 基础类/方向/线/右</title>
      <g
        id="-----🌟4.4-分页器-/-Pagination-"
        stroke="none"
        strokeWidth="1"
        fill="none"
        fillRule="evenodd"
      >
        <g id="4.4-分页器-Pagination" transform="translate(-521.000000, -752.000000)">
          <g id="分页器/上下一页/常规" transform="translate(515.000000, 746.000000)">
            <g id="1.-图标/2.-基础类/方向/线/右" transform="translate(6.000000, 6.000000)">
              <path
                d="M11.903072,5.82529801 C12.24825,5.82529801 12.528072,6.10512004 12.528072,6.45029801 C12.528072,6.76671115 12.2929438,7.02820714 11.9878808,7.0695925 L11.903072,7.07529801 L5.42833333,7.075 L5.42866804,13.549702 C5.42866804,13.8661151 5.19353981,14.1276111 4.88847684,14.1689965 L4.80366804,14.174702 C4.4872549,14.174702 4.22575891,13.9395738 4.18437355,13.6345108 L4.17866804,13.549702 L4.17866804,6.45029801 C4.17866804,6.13388487 4.41379627,5.87238888 4.71885924,5.83100352 L4.80366804,5.82529801 L11.903072,5.82529801 Z"
                id="右"
                fill="currentColor"
                transform="translate(8.353370, 10.000000) rotate(-225.000000) translate(-8.353370, -10.000000) "
              />
              <rect
                id="codesign_placeholder_name"
                x="0"
                y="2.13162821e-14"
                width="20"
                height="20"
              />
            </g>
          </g>
        </g>
      </g>
    </svg>
  );
};
export default NextIcon;
