const PrevIcon = () => {
  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="21px"
      height="21px"
      viewBox="0 0 21 21"
      version="1.1"
    >
      <title>1. 图标/2. 基础类/方向/线/左</title>
      <g
        id="-----🌟4.4-分页器-/-Pagination-"
        stroke="none"
        strokeWidth="1"
        fill="none"
        fillRule="evenodd"
      >
        <g id="4.4-分页器-Pagination" transform="translate(-161.000000, -752.000000)">
          <g id="分页器/上下一页/禁用" transform="translate(155.000000, 746.000000)">
            <g id="1.-图标/2.-基础类/方向/线/左" transform="translate(6.000000, 6.000000)">
              <path
                d="M15.1992018,5.82529801 C15.5443798,5.82529801 15.8242018,6.10512004 15.8242018,6.45029801 C15.8242018,6.76671115 15.5890736,7.02820714 15.2840106,7.0695925 L15.1992018,7.07529801 L8.72416667,7.075 L8.72479785,13.549702 C8.72479785,13.8661151 8.48966961,14.1276111 8.18460665,14.1689965 L8.09979785,14.174702 C7.78338471,14.174702 7.52188871,13.9395738 7.48050336,13.6345108 L7.47479785,13.549702 L7.47479785,6.45029801 C7.47479785,6.13388487 7.70992608,5.87238888 8.01498905,5.83100352 L8.09979785,5.82529801 L15.1992018,5.82529801 Z"
                id="左"
                fill="currentColor"
                transform="translate(11.649500, 10.000000) rotate(-45.000000) translate(-11.649500, -10.000000) "
              />
              <rect
                id="codesign_placeholder_name"
                x="0"
                y="2.13162821e-14"
                width="20"
                height="20"
              />
            </g>
          </g>
        </g>
      </g>
    </svg>
  );
};
export default PrevIcon;
